** list, tuple

그리고 배열 형태의 자료형으로는 =list= 와 =tuple= 이 대표적입니다. =list= 와 =tuple= 은 거의 비슷하게 사용할 수 있으나, =list= 는 처음 생성한 이후에도 원소를 추가, 제거하는 등 변경을 가할 수 있지만, =tuple= 은 원소에 변경을 가할 수 없습니다.

#+BEGIN_SRC python :results output :exports code
  a_list = [1, 2, 3, 4, 5]   # list
  b_list = (1, 2, 3, 4, 5)
  c_list = [6, 7, 8]

  a_list[2] == 3              # 특정 위치의 원소 참조. 참조번호는 0번부터 시작.
  a_list[-1] == 5             # 음수인 경우, 뒤에서부터 접근.
  a_list[2:4] == [3,4,5]      # 참조번호 2부터 4까지를 잘라서(slice) 반환함.
  a_list[2:] == [3,4,5]       # 참조번호 2부터 끝까지를 잘라서(slice) 반환함.
  1 in a_list == True         # 1이라는 값이 리스트에 존재하는지 여부를 반환.
  a_list + c_list == [1, 2, 3, 4, 5, 6, 7, 8]     # 두 리스트를 합친 새 리스트 반환.

  a_list.append(6)     # 맨 뒤에 6이라는 새 원소를 추가.
  a_list.insert(0, -1) # 0번째 참조번호에 -1이라는 새 원소를 추가.
  a_list.pop(0)        # 0번째 원소를 리스트에서 제거.

  a_list[2] = 0        # 참조번호 2번의 값을 0으로 변경
#+END_SRC


=tuple= 에 대해서는 변경을 가할 수 없기 때문에, =append=, =insert=, =pop= 등의 조작은 할 수 없습니다. 

=list= 및 =tuple= 에는 숫자 뿐 아니라 모든 자료형을 담을 수 있으며, 원소끼리 동질의 자료형을 가지지 않아도 됩니다.

#+BEGIN_SRC python :results output :exports code
  ['Tom', 'Chris', 'Timothy', 'Dan', 'Esther']     # 문자열의 리스트.
  ['a', 1, 'c', 2, 'e', 3]                         # 여러 타입이 섞인 리스트.
  [['a', 1], ['c', 2], ['e', 3]]                   # 리스트로 이루어진 리스트.

  [['Tom', 'M', 15, True], 
   ['Chris', 'F', 28, True], 
   ['Timothy', 'M', 32, False]]                    # 리스트로 이루어진 리스트.
#+END_SRC

=list= 및 =tuple= 은 =for= 구문과 함께 사용할 수 있습니다.

#+BEGIN_SRC python :results output :exports both
  name_list = ('Tom', 'Chris', 'Timothy', 'Dan', 'Esther')
  for name in name_list:
      print(name)
#+END_SRC

#+RESULTS:
: Tom
: Chris
: Timothy
: Dan
: Esther

다음과 같이 일종의 행과 열로 이루어진 반복도 가능합니다.

#+BEGIN_SRC python :results output :exports both
  a_list = [['Tom', 'M', 15, True], 
            ['Chris', 'F', 28, True], 
            ['Timothy', 'M', 32, False]]

  for row in a_list:
      if row[2] > 20:
          print(row)
#+END_SRC

#+RESULTS:
: ['Chris', 'F', 28, True]
: ['Timothy', 'M', 32, False]

~list~ 및 ~tuple~ 에 대해서는, 각 원소를 풀어헤쳐서 이름 있는 변수에 할당할 수 있습니다. (destructuring, 또는 tuple unpacking 이라고 합니다.)

#+BEGIN_SRC python :results output :exports both
  a_list = [['Tom', 'M', 15, True], 
            ['Chris', 'F', 28, True], 
            ['Timothy', 'M', 32, False]]

  for row in a_list:
      (name, sex, age, experience) = row
      print(name)
#+END_SRC

#+RESULTS:
: Tom
: Chris
: Timothy


** dict

이번에는 =dict= 에 대해 알아봅니다.

=dict= 는, 특정한 key에 대해 value를 기억하는 자료형입니다. 우선 =dict= 에 값을 저장하고 인출하는 기본적인 동작을 알아봅시다.

#+BEGIN_SRC python :results output :exports both
  a_dict = dict()     # dict를 생성
  a_dict = {}         # dict를 생성 (위와 동일)

  a_dict['0'] = 3          # '0'이라는 공간(key)에 3이라는 값을 저장
  a_dict['Tom'] = 'M'      # 'Tom'이라는 공간에 'M'이라는 값을 저장

  # a_dict['Heidi']          # KeyError 발생
  a_dict.get('Heidi')      # None 반환
  a_dict.get('Heidi', '?') # '?' 반환

  b_dict = {'0': 3, 'Tom': 'M'}   # {} 표현형으로 dict 정의
  c_dict = {'1': 4, 'Mary': 'F'}
  b_dict.update(c_dict)           # b dict에 c dict의 내용을 추가하여 덮어씀

  a_dict == b_dict         # 값을 하나씩 넣어서 구성한 dict와, {} 표현형으로 정의한 dict는 결과가 동일

  print(a_dict)
#+END_SRC

#+RESULTS:
: {'Tom': 'M', '0': 3}

key에 사용할 수 있는 자료형에는 제한이 없습니다만, 숫자, 문자, 문자열 등의 기본적인 자료형, 또는 그들로 이루어진 ~tuple~ 을 사용하는 것을 권장합니다.

이어서, 조금 더 복잡한 사용법을 알아봅시다.

#+BEGIN_SRC python :results output :exports both
  a_dict = {'Tom': 15, 'Chris': 28, 'Timothy': 32}

  'Tom' in a_dict == True           # dict에 'Tom'이라는 키가 존재하는지 확인
  a_dict.setdefault('Jenny', 20)    # Jenny라는 공간(key)이 없었다면 공간을 마련하고 20을 할당
  a_dict.setdefault('Tom', 20)      # Tom이라는 공간(key)이 없었다면 공간을 마련하고 20을 할당, 아니라면 무시

  print(a_dict['Jenny'] == 20)
  print(a_dict['Tom'] == 15)
#+END_SRC

#+RESULTS:
: True
: True

아래와 같이 ~dict~ 의 ~key-value~ 를 제거할 수 있습니다.

#+BEGIN_SRC python :results output :exports code
  a_dict = {'Tom': 15, 'Chris': 28, 'Timothy': 32}

  a_dict.pop('Tom')       # dict에서 'Tom' 공간을 제거하면서 그 값을 반환
  del a_dict['Tom']       # dict에서 'Tom' 공간을 제거
#+END_SRC

아래와 같이 ~dict~ 에 담겨있는 ~key~ 및 ~value~, ~(key, value)~ 의 목록을 가져올 수 있습니다.

#+BEGIN_SRC python :results output :exports both
  a_dict = {'Tom': 15, 'Chris': 28, 'Timothy': 32}

  print(a_dict.keys())   # dict에 마련된 공간 이름(key) 목록을 리스트로 반환
  print(a_dict.values()) # dict에 저장된 값의 목록을 리스트로 반환
  print(a_dict.items())  # dict에 저장된 공간 이름과 값의 목록을 중첩된 리스트로 반환
#+END_SRC

#+RESULTS:
: dict_keys(['Timothy', 'Tom', 'Chris'])
: dict_values([32, 15, 28])
: dict_items([('Timothy', 32), ('Tom', 15), ('Chris', 28)])

이렇게 가져온 목록은 ~for~ 문과 함께 사용할 수 있습니다.

#+BEGIN_SRC python :results output :exports both
  a_dict = {'Tom': 15, 'Chris': 28, 'Timothy': 32}
  for key in a_dict.keys():
      print(key)
#+END_SRC

#+RESULTS:
: Chris
: Timothy
: Tom

#+BEGIN_SRC python :results output :exports both
  a_dict = {'Tom': 15, 'Chris': 28, 'Timothy': 32}
  for value in a_dict.values():
      print(value)
#+END_SRC

#+RESULTS:
: 28
: 32
: 15

#+BEGIN_SRC python :results output :exports both
  a_dict = {'Tom': 15, 'Chris': 28, 'Timothy': 32}
  for item in a_dict.items():
      print(item)
#+END_SRC

#+RESULTS:
: ('Chris', 28)
: ('Timothy', 32)
: ('Tom', 15)

#+BEGIN_SRC python :results output :exports both
  a_dict = {'Tom': 15, 'Chris': 28, 'Timothy': 32}
  for k, v in a_dict.items():
      print('key={}, value={}'.format(k, v))
#+END_SRC

#+RESULTS:
: key=Chris, value=28
: key=Timothy, value=32
: key=Tom, value=15


** set

이번에는 =set= 에 대해 알아봅시다. ~set~ 은 값들을 유일하게 저장합니다. 유일한 값의 집합을 유지하고 싶을 때 유용합니다. 직접 예를 보시죠.

#+BEGIN_SRC python :results output :exports both
a_set = set()
a_set.add(1)
a_set.add(1)
a_set.add(1)
a_set.add(2)
a_set.add(3)
a_set.add(4)
print(a_set)
#+END_SRC

#+RESULTS:
: set([1, 2, 3, 4])

~set~ 에도 담을 수 있는 자료형에는 제한이 없습니다만, 숫자, 문자, 문자열 등의 기본적인 자료형, 또는 그들로 이루어진 튜플을 사용하는 것을 권장합니다.

~set~ 에서도 ~in~ 을 사용하여 원소 포함 여부를 검사할 수 있습니다. 그리고 ~set~ 자체를 ~for A in B~ 의 ~B~ 자리에 사용하여 각 원소를 순회하면서 작업을 수행할 수 있습니다.


** 연습문제: 단어 갯수 세기

아래와 같이 주어진 문서 내에서 unique한 단어가 몇 개인지 세어봅시다.

#+BEGIN_SRC python :results output :exports both
  # -*- coding: utf-8 -*-

  text = '프로그램 언어를 익히기 위해 책이나 글만 보면서 따라해서는 중간에 막히는 부분들이 발생합니다. 그리고 막연히 어렵게 느껴지기도 하고요. 또 어떤 경우에는 눈으로만 읽는 분들이 있는데, 눈으로만 봐서는 실제로 프로그램을 작성하기가 어렵습니다. 본 과정은 실습을 중심으로 진행합니다. 그래서, 따라할 수 있는 형태의 강의 자료가 제공됩니다. 온라인에 공개되기 때문에 수업을 듣지 않은 분들도 자료를 열람할 수 있지만, 실습을 진행하면서 발생하는 Q&A나 개별 1:1 지도, 각 개인의 프로젝트 목표에 대한 피드백 등은 제한된 메일링 리스트를 사용하여 진행합니다.'

  new_text = text.replace(',', '').replace('.', '')
  word_list = new_text.split()
  word_unique_set = set()

  for word in word_list:
      word_unique_set.add(word)

  print('Total words: {}'.format(len(word_unique_set)))
#+END_SRC

#+RESULTS:
: Total words: 69


위의 예제를 변형해서, 각 단어의 빈도가 어떻게 되는지 세어보는 프로그램을 작성해보세요. ~dict~ 를 활용해보세요.


